label w:
    scene sun with rule_2
    play music "bgm/难过.opus"
    show wudao with dissolve
    n "天台的风裹着傍晚的凉意，吹得雾岛璃音的校服领带晃了晃。"
    n "她背对着楼梯口,脚尖反复蹭着地面的裂缝。"
    w "（突然提高声音）诶,诶,杂鱼"
    w "我有个东西要跟你谈"
    l "什么？"
    w "恋爱"
    l "诶？！！！"
    l "雾岛同学开玩笑的吧"
    w "（耳朵瞬间红到脖子根，伸手推了罗坤一把）果然是杂鱼呢,这种话也相信"
    w "讷讷 罗坤先辈"
    w "（别过脸，声音变小）我...我就是看你总跟早川那丫头走太近，提醒你别耽误学习。"
    l "不过...你为什么不想让我跟早川走太近？"
    w "（沉默几秒，突然抬头）因为...我..喜欢你"
    n "风把雾岛的头发吹到脸颊，她慌忙拨开"
    n "两人并肩靠在围栏上，晚霞把影子叠在一起"
    l "雾岛同学，感情不是随便开玩笑的"
    w "（愣住）我、我..."
    n "罗坤瞥见雾岛指尖发颤，才意识到自己语气太重。"
    l "抱歉，我不是故意凶你的..."
    w "（突然哭出声）谁要你凶我！我就是...我就是喜欢你啊！"
    n "雾岛的哭声被风吹散，她把脸埋在膝盖里，肩膀一抽一抽的"
    n "晚霞把两人的影子拉得很长"
    n "雾岛戛然而止的声音略显突兀"
    n "只留下些许回音在天台回荡"
    l "（蹲在她身边）我知道了"
    w "罗坤同学请和我交往吧"
    w "我给你看我的特殊cg"
    stop music
    menu:
        "我要看特殊CG":
            jump CGw
        "我是纯爱战士":
            jump love
    return 
label CGw:
    call open_movie_playing from _call_open_movie_playing
    return

label love:
    play music "bgm/难过.opus"
    $ achievement.grant("南通蒸鹅心")
    $ renpy.notify("成就解锁:南通蒸鹅心")
    n "罗坤以为搞纯爱为理由拒绝了雾岛"
    n "从此和王大爷幸福快乐的生活在一起"
    return